<template>
  <div :class="$style.mainPageWrapper">
    <Banner />
    <MainAbout
      title="КТО МЫ?"
      description="ГЕОМЕТРИЯ РЕМОНТА — это команда профессионалов, готовая реализовать
ремонт «под ключ» любого формата и любой сложности"
      :class="$style.section"
    />
    <Direction
      :title="directionData.title"
      :description="directionData.description"
      :class="$style.section"
      :additionally="dataAdditionally"
    />
    <MainReasons :reasons="reasons" />
  </div>
</template>

<script setup lang="ts">
import Banner from '~/components/Main/Banner.vue';
import Direction from '~/components/Main/Direction.vue';

const directionData = {
  title: 'НАШИ НАПРАВЛЕНИЯ',
  description: [
    {
      text: 'Ремонт по индивидуальным дизайн-проектам',
    },
    {
      text: 'Ремонт по индивидуальным дизайн-проектам',
    },
    {
      text: 'Ремонт по индивидуальным дизайн-проектам',
    },
    {
      text: 'Ремонт по индивидуальным дизайн-проектам',
    },
  ],
};

const dataAdditionally = [
  {
    text: 'Осуществляем профессиональную приёмку квартир от застройщика с сертифицированными специалистами;',
  },
  { text: 'Разработка дизайн-проектов;' },
  { text: 'Помощь с выбором и поставкой сантехники и мебели на выгодных условиях.' },
];

const reasons = [
  {
    title: 'Стоимость известна заранее известна заранее',
    text: 'Она фиксирована. Вы можете рассчитать её прямо сейчас на сайте. После заключения договора стоимость не меняется независимо от ситуации на рынке.',
  },
  {
    title: 'Стоимость известна заранее известна заранее',
    text: 'Она фиксирована. Вы можете рассчитать её прямо сейчас на сайте. После заключения договора стоимость не меняется независимо от ситуации на рынке.',
  },
  {
    title: 'Стоимость известна заранее известна заранее',
    text: 'Она фиксирована. Вы можете рассчитать её прямо сейчас на сайте. После заключения договора стоимость не меняется независимо от ситуации на рынке.',
  },
  {
    title: 'Стоимость известна заранее известна заранее',
    text: 'Она фиксирована. Вы можете рассчитать её прямо сейчас на сайте. После заключения договора стоимость не меняется независимо от ситуации на рынке.',
  },
  {
    title: 'Стоимость известна заранее известна заранее',
    text: 'Она фиксирована. Вы можете рассчитать её прямо сейчас на сайте. После заключения договора стоимость не меняется независимо от ситуации на рынке.',
  },
  {
    title: 'Стоимость известна заранее известна заранее',
    text: 'Она фиксирована. Вы можете рассчитать её прямо сейчас на сайте. После заключения договора стоимость не меняется независимо от ситуации на рынке.',
  },
  {
    title: 'Стоимость известна заранее известна заранее',
    text: 'Она фиксирована. Вы можете рассчитать её прямо сейчас на сайте. После заключения договора стоимость не меняется независимо от ситуации на рынке.',
  },
];

// const config = useRuntimeConfig();
</script>

<style module lang="scss">
.mainPageWrapper {
  position: relative;
  display: flex;
  flex-direction: column;
  width: 100%;
  height: auto;
  overflow: hidden;
}

.section {
  padding-top: 4rem;
  padding-bottom: 4rem;
}
</style>
